#pragma

//ゲームメインで扱う変数、関数
class MAIN
{
public:

	void Main();	//メイン処理関数
	void Draw();	//描画処理

	//配列要素数
	int num_x= 9;			
	int num_y = 10;

	//ボードのマスの二次元配列  (0は空白、1は白、2は黒、3は白黒、9は壁）
	int Init_board[9][10] = {											//初期化用	
	{9,0,0,0,0,0,0,0,0,9},		//メダルを落とす所を選択する場所
	{9,0,0,0,0,0,0,0,0,9},		//メダルを落とせる場所
	{9,0,0,0,0,0,0,0,0,9},		//↓
	{9,0,0,0,0,0,0,0,0,9},		//↓
	{9,0,0,0,0,0,0,0,0,9},		//↓
	{9,0,0,0,0,0,0,0,0,9},		//↓
	{9,0,0,0,0,0,0,0,0,9},		//↓
	{9,0,0,0,0,0,0,0,0,9},		//ここまで
	{9,9,9,9,9,9,9,9,9,9},		//壁
	};
	int Main_board[9][10];												//対戦処理用

	int select_num=0;		//選択している要素

	//メダルの置く場所を選択
	int medal_select= board_x+medal_size* select_num+10;		//メダルの表示位置　(+10)は枠とメダルの幅


private:



	//ゲームの枠の横,縦の位置
	int board_x = 120;
	int board_y = 105;	
	//ゲームの枠の幅の位置
	int board_w = 560;
	int board_h = 490;


	int medal_size = 60;	//メダルの大きさ 60×60




};
